wrk2/baseline/10KB/wrk-eth3-rep07.log
Running 30s test @ https://bench-eth2.netdev-lab.org/10k.bin
  4 threads and 100 connections
  Thread calibration: mean lat.: 1.601ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.613ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.615ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.654ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.65ms  648.25us  15.68ms   67.83%
    Req/Sec     2.11k   192.84     3.00k    69.70%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.61ms
 75.000%    2.07ms
 90.000%    2.45ms
 99.000%    3.23ms
 99.900%    4.56ms
 99.990%   11.87ms
 99.999%   14.06ms
100.000%   15.69ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.403     0.000000            1         1.00
       0.840     0.100000        15931         1.11
       1.060     0.200000        31848         1.25
       1.256     0.300000        47750         1.43
       1.435     0.400000        63645         1.67
       1.612     0.500000        79559         2.00
       1.702     0.550000        87504         2.22
       1.790     0.600000        95464         2.50
       1.881     0.650000       103391         2.86
       1.975     0.700000       111337         3.33
       2.073     0.750000       119347         4.00
       2.125     0.775000       123387         4.44
       2.179     0.800000       127308         5.00
       2.237     0.825000       131312         5.71
       2.299     0.850000       135212         6.67
       2.369     0.875000       139169         8.00
       2.409     0.887500       141149         8.89
       2.451     0.900000       143147        10.00
       2.499     0.912500       145150        11.43
       2.553     0.925000       147134        13.33
       2.615     0.937500       149100        16.00
       2.651     0.943750       150090        17.78
       2.689     0.950000       151075        20.00
       2.731     0.956250       152062        22.86
       2.783     0.962500       153078        26.67
       2.843     0.968750       154061        32.00
       2.875     0.971875       154535        35.56
       2.915     0.975000       155040        40.00
       2.955     0.978125       155537        45.71
       3.005     0.981250       156030        53.33
       3.069     0.984375       156531        64.00
       3.107     0.985938       156773        71.11
       3.153     0.987500       157025        80.00
       3.203     0.989062       157271        91.43
       3.257     0.990625       157525       106.67
       3.331     0.992188       157771       128.00
       3.367     0.992969       157887       142.22
       3.417     0.993750       158016       160.00
       3.471     0.994531       158137       182.86
       3.535     0.995313       158260       213.33
       3.609     0.996094       158384       256.00
       3.665     0.996484       158446       284.44
       3.715     0.996875       158510       320.00
       3.783     0.997266       158573       365.71
       3.861     0.997656       158633       426.67
       3.987     0.998047       158695       512.00
       4.063     0.998242       158726       568.89
       4.155     0.998437       158759       640.00
       4.251     0.998633       158789       731.43
       4.387     0.998828       158819       853.33
       4.603     0.999023       158851      1024.00
       4.731     0.999121       158866      1137.78
       4.899     0.999219       158882      1280.00
       5.103     0.999316       158897      1462.86
       5.507     0.999414       158913      1706.67
       6.099     0.999512       158928      2048.00
       6.507     0.999561       158936      2275.56
       6.903     0.999609       158943      2560.00
       7.539     0.999658       158951      2925.71
       7.931     0.999707       158959      3413.33
       8.839     0.999756       158967      4096.00
       9.023     0.999780       158971      4551.11
       9.407     0.999805       158974      5120.00
       9.903     0.999829       158978      5851.43
      10.999     0.999854       158982      6826.67
      11.591     0.999878       158986      8192.00
      11.799     0.999890       158988      9102.22
      12.119     0.999902       158990     10240.00
      12.631     0.999915       158992     11702.86
      12.695     0.999927       158994     13653.33
      12.839     0.999939       158996     16384.00
      13.063     0.999945       158997     18204.44
      13.151     0.999951       158998     20480.00
      13.263     0.999957       158999     23405.71
      13.303     0.999963       159000     27306.67
      13.487     0.999969       159001     32768.00
      13.487     0.999973       159001     36408.89
      13.559     0.999976       159002     40960.00
      13.559     0.999979       159002     46811.43
      14.055     0.999982       159003     54613.33
      14.055     0.999985       159003     65536.00
      14.055     0.999986       159003     72817.78
      14.159     0.999988       159004     81920.00
      14.159     0.999989       159004     93622.86
      14.159     0.999991       159004    109226.67
      14.159     0.999992       159004    131072.00
      14.159     0.999993       159004    145635.56
      15.687     0.999994       159005    163840.00
      15.687     1.000000       159005          inf
#[Mean    =        1.646, StdDeviation   =        0.648]
#[Max     =       15.680, Total count    =       159005]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  239561 requests in 30.00s, 2.34GB read
Requests/sec:   7985.03
Transfer/sec:     79.93MB