wrk2/baseline/10KB/wrk-wlan0-rep05.log
Running 30s test @ https://bench-eth2.netdev-lab.org/10k.bin
  4 threads and 100 connections
  Thread calibration: mean lat.: 201.267ms, rate sampling interval: 1198ms
  Thread calibration: mean lat.: 208.944ms, rate sampling interval: 1110ms
  Thread calibration: mean lat.: 179.010ms, rate sampling interval: 1027ms
  Thread calibration: mean lat.: 166.815ms, rate sampling interval: 926ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   266.03ms  341.55ms   2.51s    85.99%
    Req/Sec     1.22k   134.50     1.70k    69.86%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  149.63ms
 75.000%  386.30ms
 90.000%  743.93ms
 99.000%    1.49s 
 99.900%    2.00s 
 99.990%    2.42s 
 99.999%    2.50s 
100.000%    2.51s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.711     0.000000            1         1.00
       4.025     0.100000         9717         1.11
       5.231     0.200000        19441         1.25
       7.571     0.300000        29144         1.43
      72.831     0.400000        38862         1.67
     149.631     0.500000        48576         2.00
     182.271     0.550000        53431         2.22
     212.479     0.600000        58312         2.50
     261.375     0.650000        63149         2.86
     320.255     0.700000        68012         3.33
     386.303     0.750000        72874         4.00
     424.959     0.775000        75289         4.44
     471.295     0.800000        77720         5.00
     522.751     0.825000        80155         5.71
     581.631     0.850000        82598         6.67
     652.287     0.875000        85012         8.00
     695.295     0.887500        86218         8.89
     743.935     0.900000        87432        10.00
     795.135     0.912500        88646        11.43
     854.527     0.925000        89865        13.33
     922.623     0.937500        91076        16.00
     961.535     0.943750        91683        17.78
    1004.031     0.950000        92291        20.00
    1052.671     0.956250        92901        22.86
    1104.895     0.962500        93503        26.67
    1165.311     0.968750        94111        32.00
    1198.079     0.971875        94419        35.56
    1228.799     0.975000        94720        40.00
    1264.639     0.978125        95019        45.71
    1306.623     0.981250        95325        53.33
    1358.847     0.984375        95640        64.00
    1389.567     0.985938        95789        71.11
    1423.359     0.987500        95930        80.00
    1462.271     0.989062        96085        91.43
    1503.231     0.990625        96236       106.67
    1558.527     0.992188        96388       128.00
    1587.199     0.992969        96463       142.22
    1611.775     0.993750        96538       160.00
    1640.447     0.994531        96613       182.86
    1674.239     0.995313        96692       213.33
    1711.103     0.996094        96766       256.00
    1729.535     0.996484        96803       284.44
    1751.039     0.996875        96842       320.00
    1771.519     0.997266        96880       365.71
    1794.047     0.997656        96917       426.67
    1823.743     0.998047        96955       512.00
    1842.175     0.998242        96974       568.89
    1864.703     0.998437        96993       640.00
    1894.399     0.998633        97012       731.43
    1941.503     0.998828        97031       853.33
    2006.015     0.999023        97050      1024.00
    2056.191     0.999121        97059      1137.78
    2111.487     0.999219        97069      1280.00
    2140.159     0.999316        97078      1462.86
    2201.599     0.999414        97088      1706.67
    2263.039     0.999512        97097      2048.00
    2287.615     0.999561        97103      2275.56
    2306.047     0.999609        97107      2560.00
    2318.335     0.999658        97111      2925.71
    2338.815     0.999707        97116      3413.33
    2359.295     0.999756        97121      4096.00
    2371.583     0.999780        97123      4551.11
    2383.871     0.999805        97126      5120.00
    2390.015     0.999829        97128      5851.43
    2396.159     0.999854        97130      6826.67
    2420.735     0.999878        97133      8192.00
    2422.783     0.999890        97134      9102.22
    2428.927     0.999902        97135     10240.00
    2437.119     0.999915        97136     11702.86
    2441.215     0.999927        97137     13653.33
    2453.503     0.999939        97139     16384.00
    2453.503     0.999945        97139     18204.44
    2457.599     0.999951        97140     20480.00
    2457.599     0.999957        97140     23405.71
    2476.031     0.999963        97141     27306.67
    2492.415     0.999969        97142     32768.00
    2492.415     0.999973        97142     36408.89
    2492.415     0.999976        97142     40960.00
    2492.415     0.999979        97142     46811.43
    2504.703     0.999982        97143     54613.33
    2504.703     0.999985        97143     65536.00
    2504.703     0.999986        97143     72817.78
    2504.703     0.999988        97143     81920.00
    2504.703     0.999989        97143     93622.86
    2514.943     0.999991        97144    109226.67
    2514.943     1.000000        97144          inf
#[Mean    =      266.030, StdDeviation   =      341.555]
#[Max     =     2512.896, Total count    =        97144]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  144762 requests in 30.00s, 1.42GB read
Requests/sec:   4825.09
Transfer/sec:     48.30MB